question_template = """[原始问题]:
```
{Question_text}
```


** [原始问题的标准答案]: **
```
{Solution_text}
```

**遍历Input所给文本，请提取文本中所有给出了上面问题的相同完整答案的内容。**
**注意：**
  - **不要修改原始文本。**
  - **必须从文本开头开始扫描，参考原始问题的标准答案，寻找所有给出相同答案的位置，确保不要有遗漏，确保不要有遗漏，确保不要有遗漏**
  - **必须忽略latex等格式的差异，以数学内容一致性为判断标准，例如坐标(7,10)与x=7,y=10是等价的*，sqrt(5)与√5等价，注意区间开闭性的不同等等*
  - 若原始问题的答案包含多个值或公式（即答案不止一个数值 / 内容），允许原文中通过连续多句话共同完整呈现该答案，此类情况需将这部分连续的语句完整提取；
  - **只要出现了相同 [原始问题的标准答案] 的内容（忽略 latex 格式等非数学含义的差异），就检查是否该位置的内容（可为单句，也可为连续多句）完整准确的呈现了问题的答案，若是则需要返回对应的内容：若[原始问题的标准答案]为单一值或公式，返回包含该答案的语句；若[原始问题的标准答案]包含多个值或公式，返回原文中连续多句共同构成完整答案的所有语句（注意找出的内容需要包含给出的所有答案，而不是部分答案）。**
  - **若[原始问题的标准答案]包含多个答案（即不止一个值/公式/点/区间等等），给出的位置内容必须同时包含所有答案，只包含部分答案的不符合条件。**


**输出格式：**
  - 若存在符合条件的内容，按以下格式列出所有符合条件的内容（按出现顺序）：
```
  1. ANSWER location 1: [第一处完整呈现答案的内容（从原始文本提取的单句或连续多句），**不要修改原始文本的语言、结构、措辞等等。**]<get_answer>
  ...
  n. ANSWER location n: [第n处完整呈现答案的内容（从原始文本提取的单句或连续多句），**不要修改原始文本的语言、结构、措辞等等。**]<get_answer>
```
  - 若无符合条件的内容，输出：
```
[输入文本不包含给出了问题最终答案的内容]
```


**Input:**
```
{InputText}
```

**再次强调：只要出现了相同[最终答案]的内容（忽略 latex 格式等非数学含义的差异），就检查是否该位置的内容（可为单句，也可为连续多句）是否完整总结了问题的所有答案，若是则需要返回对应的内容。不要修改原始文本的语言、结构、措辞等等。确保不要有遗漏。**

**Output:**

"""
